---
layout: single
title: "Transfer Learning"
categories: LLM
tag: [패스트캠퍼스,패스트캠퍼스AI부트캠프,업스테이지패스트캠퍼스,UpstageAILab,국비지원,패스트캠퍼스업스테이지에이아이랩,패스트캠퍼스업스테이지부트캠프]
use_math: true
---

## Transfer Learning 이란?
- 이미 배운 지식이나 기술을 다른 비슷한 문제에 다시 활용 하는 벙법으로
- 대량의 텍스트 데이터로 언어 자체를 이해하는 모델을 먼저 만드고 요약,문류 등 다양한 작업에 사용하는 것

## Why?
과거 자연어 처리 기술로 단어를 컴퓨터가 이해할 수 있는 숫자 형태(단어 임베딩)으로 표기하거나
(예: Word2vec, GloVe) 구글번역기 처럼 신경망 기반으로 번역 오류를 크게 줄이는 성과가 있었지만
큰 한계가 있었다.

- **언어의 모호성 (다의어 문자)** : "apple"은 과일/기업 동의어로 하나의 고정된 벡터만 할당해서
문맥에 따라 달라지는 단어의 다양한 의미를 제대로 표현 하지 못함

- **대용량 학습 데이터의 필요성** : 번역,문서 분류,질문 답변 등 **각각의 작업을 해결하려면 해당 작업에 대한 엉청나게 많은 학습 데이터 필요 했지만 각 작업별 일일이 수집하고 전처리 하는 것이 너무 어렵고 비효율적이다.**

## 전의 학습의 두 가지 핵심 과정
- ### 사전 학습(Pre-training):
  - 이 단계에서는 레이블(정답)이 없는 아주 방대한 양의 데이터 (예: 인터넷의 모든글,뉴스,위키피디아 등)를 사용하여
  모델을 먼저 훈련
  - 이때 특정 작업이 아닌, 언어 자체에 대한 기본적인 지식(언어의 관계, 문장의 구조 등)을 학습 하게 됩니다.
  - 이렇게 레이블 없는 데이터를 무제한으로 확보하여 활용할 수 있다는 것이 **가장큰 장점**

- ### 미세 조정 (Fine-tuning):
  - 사전 학습을 마친 모델에 특적 작업 (예: 문서 요약, 번역)에 맞는 소령의 레이블된 데이터로 학습
  - 기존 방법보다 빠르고 좋은 성능을 낼수 있다.

## 사전학습 및 미세조정 NLP 첫 적용한 ELMO 모델 이란?
  - ELMO은 사전학습 및 미세조정 패러다임을 NLP 분야에 처음 적용으로 설공을 거둔 대표적인 초기 모델
  - **문맥 정보를 반영한 단어 임베딩** : 기존 동의어 문제의 임베딩을 극복하기 위해 문잔 전처를 보고 단어 임베딩을 생성
  - **why 어떻게 문맥을 반영했는가?** : 앞에서 뒤로 (순반향)/ 뒤에서 앞으로 (역반향)으로 두 방향에 얻은 정보를 합쳐 최종 단어 임베딩을 생성
  - **성과** : 기존모델보다/ 적은 데이터로도 높은 성능

## ELMO 한계점
- 독립적인 학습과 단순 결과 : 순반향,역반향을 각각 독립적으로 진행 결과를 단순 concat 결합으로 두방향의 정보를
조화롭게 사용하지 못한 한계

이러한 ELMO 의 한계점들은 이후 BERT와 같이 발전된 모델이 등장하는 계기가 되었고
현재 대부분 NLP 작업에는 ELMO 와 같은 사전 학습된 언어 모델(PLM) 을 활용하는 것이
일반적인 대세로 자리 잡았다.